In [1]:
import pandas as pd

# USING LIST

In [2]:
data=[['Siddu',56] , ['Poshya',98] , ['Nithya',87] , ['Thoshi',84] , ['Hurdith',92]]
print(data)
print(type(data))

[['Siddu', 56], ['Poshya', 98], ['Nithya', 87], ['Thoshi', 84], ['Hurdith', 92]]
<class 'list'>

In [5]:
df=pd.DataFrame(data , columns=["Name" , "Marks"])
df

      Name  Marks
0    Siddu     56
1   Poshya     98
2   Nithya     87
3   Thoshi     84
4  Hurdith     92

# USING DICTIONARY OF LIST

In [6]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

df = pd.DataFrame(data)
print(df)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

# USING NUMPY ARRAYS

In [7]:
import numpy as np

In [8]:
arr=np.array([[2,3],[5,6]])
arr

array([[2, 3],
       [5, 6]])

In [9]:
df=pd.DataFrame(arr,columns=["A","C"])
df

   A  C
0  2  3
1  5  6

# USING EXCELL

In [11]:
df=pd.read_excel("data.xlsx")

In [12]:
df

        NAME SCHOOL  MARKS
0  Siddartha    KVS     76
1    Bruhati    DPS     54
2      Jagan    KVS     98
3     Lahari    DAV     87
4     Lokesh  SLATE     87
5     Monish    APS     66
6      Robin    AFS     58
7     Avdesh    JNV     78
8       Ugra    HPS     54

# USING CSV

In [13]:
df=pd.read_csv("data1.csv")
df

    PLAYER TEAM  RUNS
0    Virat  RCB   973
1    Rohit   MI   765
2    Dhoni  CSK   456
3  Cummins  SRH   324
4   Pandya   MI   345
5     Gill   GT   876
6  Jaiswal   RR   677
7   Samson   RR   455
8   Sachin   MI   675

# USING JSON

In [16]:
df=pd.read_json("data2.json")
df

    name  age branch                                      marks  attendance
0  Aarav   20    ECE  {'math': 85, 'physics': 78, 'coding': 92}        88.5
1   Diya   21    CSE  {'math': 90, 'physics': 82, 'coding': 95}        94.2
2  Kabir   19   MECH  {'math': 76, 'physics': 69, 'coding': 80}        75.0
3   Sana   20    EEE  {'math': 88, 'physics': 91, 'coding': 89}        90.1

# USING URL

In [17]:
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

EDA (Exploratory Data Analysis)
Exploratory Data Analysis (EDA) is an essential first step in any data science project.

It involves taking a deep look at the dataset to understand its structure, spot patterns, identify anomalies, and uncover relationships between variables. This process includes generating summary statistics, checking for missing or duplicate data, and creating visualizations like histograms, box plots, and scatter plots. The goal of EDA is to get a clear picture of what the data is telling you before applying any analysis or machine learning models.

By exploring the data thoroughly, you can make better decisions about how to clean, transform, and model it effectively.

Once your DataFrame is ready, run these to understand your data:

In [18]:
df.head()  # First 5 rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
df.tail() # Last 5 rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [20]:
df.info()  # Column info: types, non-nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [21]:
df.describe() # Stats for numeric columns

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [22]:
df.columns  # List of column names

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [23]:
df.shape   # (rows, columns)

(244, 7)